{
  "navbar-home": "الرئيسية",
  "navbar-about": "من نحن",
  "navbar-services": "الخدمات",
  "navbar-solutions" : "الحلول",
  "navbar-systems": "الأنظمة",
  "navbar-portfolio": "أعمالنا",
  "navbar-blog":"المدونة",
  "navbar-contact": "تواصل معنا",
  "get-a-Quote": "اتخذ خطوة",
  "contact-us": "تواصل معنا",
  "At-Al-Amanara-we-turn-your-ideas-nto-reality" : "في العالمية الحرة نُحول أفكارك إلى واقع",
  "Through-creativity-and-technology" : "بالإبداع والتكنولوجيا، نجعل أفكارك واقعًا. انضم إلينا وشارك في تحويل مشروعك إلى تجربة رقمية استثنائية!",
  "security": "الأمان",
  "We-are-dedicated-to-providing-innovative":"نحن ملتزمون بتوفير التكنولوجيا المبتكرة التي تحمي معلومات عملائنا بأقصى قدر من الأمان. انضم إلينا في رحلة التميز التكنولوجي حيث يلتقي الابتكار بالأمان.",
  "speed": "السرعة",
  "We-strongly-believe-in-the-power-of-technology":"نحن نؤمن بشدة بقوة التكنولوجيا في تعزيز الأعمال، ولهذا السبب نقدم خدمات سريعة وفعالة لتلبية احتياجات عملائنا على الفور.",
  "quality": "الجودة",
  "We-are-committed-to-achieving-the-highest-levels":"نحن ملتزمون بتحقيق أعلى مستويات الجودة في كافة الخدمات والمنتجات التي نقدمها لعملائنا، وذلك بفضل خبرتنا وفريق العمل المتخصص.",
  "Send-your-message":"ارسل رسالتك",
  "we-conduct-a-comprehensive-study":"نقوم بإجراء دراسة وتحليل شاملين لمشروعك للوصول إلى المفاهيم الأساسية.",
  "start-a-free-consultation":"احصل علي استشارة مجانية",
  "location-one":"السعودية - جدة",
  "location-two":"سوريا - طرطوس",
  "address-one": "جدة - ابحر الشمالية - شارع الأمير عبدالمحيد - مركز الخير - الدور الثاني - مكتب رقم 9",
  "address-two": "سوريا - طرطوس - يقل - ليققيل - مكتب 501",
  "email":"manarahalabtkar@gmail.com",
  "mobile-ksa": "+966 500473509",
  "mobile-sy": "+963 935763689",
  "ready-to-get-started":"جاهز لتبدأ؟",
  "let's-build-best-digital":"دعنا نبني أفضل الحلول الرقمية لعملك الآن!",
  "your-full-name":"الاسم بالكامل",
  "your-email":"بريدك الالكتروني",
  "phone-number":"رقم الهاتف",
  "subject":"الموضوع",
  "your-message":"أدخل رسالتك هنا",

  "Design-&-Devlopment": "تصميم وتطوير",
  "Web-development": "تطوير الويب",
  "Apps-Development": "تطوير التطبيقات",
  "Hosting_Services": "خدمات الاستضافة",
  "cloud-hosting": "استضافة سحابية",
  "web-hosting": "استضافة الويب",
  "dedicated-server": "خادم مخصص",
  "server-management": "إدارة الخادم",
  "Digital-marketing-services": "خدمات التسويق الرقمي",
  "digital-marketing": "التسويق الرقمي",
  "design-services": "خدمات التصميم",
  "Additional-Services": "خدمات إضافية",
  "technical-analysis": "التحليل الفني",
  "corporate-systems": "أنظمة الشركات",
  "software-testing": "اختبار البرمجيات",
  "project-management": "إدارة المشاريع",
  "business-development": "تطوير الأعمال",
  "technical-support": "الدعم الفني",
  "get-a-distinguished-website": "احصل على موقع متميز يلبي احتياجاتك وينمي عملك مع خدمة تصميم الويب من منارة الابتكار. سواء كنت تدير متجرًا عبر الإنترنت أو مطعمًا أو وكالة أو أي شيء آخر، سنعمل معك يدًا بيد لتحقيق رؤية علامتك التجارية والنجاح عبر الإنترنت من خلال موقع متجاوب يعمل بسلاسة على جميع الأجهزة وتصميم جذاب يجذب انتباه زوارك.",
  "intro-video": "فيديو تعريفي",

  "''''''''''''''''web-section-one'''''''''''''":"",

  "title-m-section-one-web": "الخدمات التي تقدمها منارة الابتكار لتصميم الويب",
  "para-m-section-one-web": "صمم موقعك مع منارة الابتكار واستمتع بتجربة مخصصة لتناسب احتياجاتك. نحن نقدم العديد من الميزات:",
  "title-m-section-one-intro-web-one": "لغات البرمجة الحديثة",
  "para-m-section-one-intro-web-one": "نستخدم أحدث لغات البرمجة المتقدمة التي تتيح لك تعديل موقعك بسهولة ومرونة وسرعة.",
  "title-m-section-one-intro-web-two": "محتوى فريد وجذاب",
  "para-m-section-one-intro-web-two": "نقدم محتوى مقنع يجذب انتباه القراء ويحفزهم على مواصلة تصفح موقعك.",
  "title-m-section-one-intro-web-three": "موقع يناسب العلامة التجارية",
  "para-m-section-one-intro-web-three": "سنقوم بتصميم موقع يتماشى مع علامتك التجارية ويعكس رغبات واحتياجات عملائك.",
  "title-m-section-one-intro-web-four": "استضافة موثوقة",
  "para-m-section-one-intro-web-four": "نقدم خدمات استضافة تتناسب مع خطتك السعرية واحتياجاتك، مما يضمن أداءً سلسًا ومستقرًا لموقعك.",

  "''''''''''''''''web-DBMS-one + two'''''''''''''":"",

  "title-m-DBMS-web-one": "لماذا تختار منارة الابتكار لتصميم موقعك الإلكتروني؟",
  "title-card-m-DBMS-web-one": "فريق محترف",
  "para-card-m-DBMS-web-one": "تضم منارة الابتكار فريقًا استثنائيًا من المحترفين ذوي الخبرة في تصميم المواقع الإلكترونية. سنساعدك في إنشاء موقع بتصميم فريد وألوان حديثة ومميزة تعكس هوية عملك.",
  "title-card-m-DBMS-web-two": "تصميم متجر إلكتروني",
  "para-card-m-DBMS-web-two": "مع خدمة تصميم المواقع من منارة الابتكار، يمكنك الحصول على متجر إلكتروني احترافي لعرض جميع منتجاتك وأسعارك وتفاصيل الطلبات ومعلومات الشحن لعملائك.",
  "title-card-m-DBMS-web-three": "تصميم ويب ديناميكي",
  "para-card-m-DBMS-web-three": "تعتمد منارة الابتكار على أحدث تقنيات برمجة الويب في تصميم المواقع لتمكين عملائنا من إنشاء موقع سريع وسهل الاستخدام وقابل للتكيف بسهولة ومحسن لمحركات البحث.",
  "title-card-m-DBMS-web-four": "تكامل وسائل التواصل الاجتماعي",
  "para-card-m-DBMS-web-four": "نساعدك في إنشاء موقع متصل بحسابات وسائل التواصل الاجتماعي الخاصة بعملك، حيث يتم عرض أيقونات تلك الحسابات في تصميم الموقع.",
  "title-card-m-DBMS-web-five": "بناء الثقة والمصداقية",
  "para-card-m-DBMS-web-five": "من خلال خدمة تصميم المواقع من منارة الابتكار، يمكنك زيادة ثقة العملاء ومصداقيتهم من خلال تقديم معلومات دقيقة ومحدثة عن منتجاتك وخدماتك على موقعك. يشمل ذلك عرض المراجعات والتعليقات من العملاء الآخرين وعرض شهادات الجودة والشهادات المهنية والشراكات وغيرها من جهود العلاقات العامة التي تساعد في بناء الثقة بين الشركة والعملاء.",
  
  "title-m-DBMS-two-web": "قواعد البيانات المستخدمة في تصميم الويب الخلفي",
  "title-card-m-DBMS-two-web-one": "SQL",
  "para-card-m-DBMS-two-web-one": "SQL هو نوع من قواعد البيانات وهو لغة استلام هيكلية. تُستخدم هذه اللغة في تصميم المواقع الإلكترونية لتخزين ومعالجة المعلومات في قواعد البيانات. يتم تخزين هذه المعلومات في شكل جدول يتكون من مجموعة من الصفوف والأعمدة التي تمثل السمات المختلفة للبيانات وكذلك العلاقات بين تلك البيانات. يمكننا أيضًا استخدام SQL للحفاظ على أداء قواعد البيانات وتحسينه.",
  "title-card-m-DBMS-two-web-two": "MongoDB في تصميم الويب",
  "para-card-m-DBMS-two-web-two": "يُستخدم MongoDB لإدارة قواعد البيانات وهو نظام مفتوح المصدر يمكن لجميع المبرمجين استخدامه. تتخصص هذه القاعدة في إدارة قواعد البيانات غير العلائقية. يتيح لنا MongoDB أيضًا إدارة المعلومات في قواعد البيانات، سواء كانت أوامر تتعلق بالحذف أو التعديل أو الإضافة.",
  "title-card-m-DBMS-two-web-three": "NoSQL في تصميم الويب",
  "para-card-m-DBMS-two-web-three": "تمنحنا قاعدة بيانات NoSQL معلومات كاملة عن نماذج البيانات التي تشمل القيم الرئيسية والرسوم البيانية والمستندات. يمكننا تحسين هذه النماذج بسهولة وفقًا للأداء والحجم.",

  "''''''''''''''''web-slider-one + two'''''''''''''":"",

  "title-m-slider-web": "الأدوات المستخدمة من قبل مطوري الواجهة الخلفية في منارة الابتكار",
  "title-card-m-slider-web-one": "Node.Js",
  "para-card-m-slider-web-one": "يضمن لنا Node.Js الحصول على نتائج احترافية مع ضمان توفير الكثير من الوقت والجهد في نفس الوقت عند تصميم المواقع. Node.Js مفتوح المصدر ومتاح لجميع المبرمجين، ولهذا السبب يسهل علينا استخدامه عند تصميم المواقع.",
  "title-card-m-slider-web-two": "إطار عمل Vue.js في تصميم الويب",
  "para-card-m-slider-web-two": "هو إطار عمل JavaScript مخصص لبناء تطبيقات الويب والمواقع الإلكترونية. يتميز هذا الإطار بالسرعة العالية والأداء المتميز، وهو إطار عمل رسمي وصلب لتنفيذ المهام المختلفة.",
  "title-card-m-slider-web-three": "لغة Java في تصميم الويب",
  "para-card-m-slider-web-three": "هي لغة برمجة مفتوحة المصدر ومستقرة. تُستخدم أيضًا للأغراض العامة، والأهم من ذلك أنها لغة آمنة.",
  "title-card-m-slider-web-four": "تصميم المواقع باستخدام لغة C#",
  "para-card-m-slider-web-four": "هي لغة برمجة حديثة ومتقدمة نلجأ إليها في الاستخدامات العامة، وهي لغة موجهة للكائنات في أساسها حيث أنها مشتقة من لغة C++. ما يميزها عن C++ هو أنها تبسط تعقيدات هذه اللغة.",
  "title-card-m-slider-web-five": "لغة Python",
  "para-card-m-slider-web-five": "Python هي لغة برمجة عامة يمكن استخدامها في العديد من المجالات، بما في ذلك تصميم الويب. يمكن استخدام Python في تطوير الواجهة الأمامية، ولكن استخدامها الأكثر شيوعًا في تصميم الويب هو في تطوير الواجهة الخلفية، حيث تُستخدم في تطوير السكربتات وإدارة قواعد البيانات وتطوير الوظائف الأساسية للموقع.",
  "title-card-m-slider-web-six": "ASP في تصميم الويب",
  "para-card-m-slider-web-six": "لدى ASP طريقة محددة للتعامل مع البيانات والمدخلات، مما يجعلها سريعة وتوفر مستوى عالٍ من الحماية في نفس الوقت. تعمل ASP بتقنية MCV، وتُستخدم هذه التقنية لتقسيم الأجزاء المختلفة من الموقع، وهذا بدوره يوفر لنا كمبرمجين تحكمًا أكبر، كما يوفر لنا حماية أكبر.",
  "title-card-m-slider-web-seven": "لغة PHP في تصميم الويب",
  "para-card-m-slider-web-seven": "PHP هي لغة برمجة تم تطويرها لتطوير الويب، تُستخدم عادةً لتكوين المواقع والتفاعل مع قواعد البيانات. إنها لغة برمجة قوية وسهلة الاستخدام.",

  "title-m-slider-web-two": "لغات البرمجة",
  "para-m-slider-web-two": "لغات البرمجة المستخدمة في تصميم الويب",
  "title-card-m-slider-two-web-one": "لغة HTML في تصميم الويب",
  "para-card-m-slider-two-web-one": "هي لغة ترميز تتكون بشكل أساسي من الأوامر والعلامات التي يستخدمها مصممو الويب في تصميم المواقع. لغة الترميز هي علامات، وهي نصوص عادية مع علامات مصممة لتحديد أقسام الصفحة، والنص الفائق هو نص يحتوي على روابط يمكن للمستخدمين النقر عليها للانتقال من صفحة إلى أخرى أو من جزء من نفس الصفحة إلى آخر.",
  "title-card-m-slider-two-web-two": "لغة CSS في تصميم الويب",
  "para-card-m-slider-two-web-two": "هي لغة وصفية تساهم بشكل رئيسي في تمييز الموقع بشكله وتصميمه الفريد. تُستخدم هذه اللغة غالبًا مع HTML عند تصميم الويب. هنا، HTML هو الأساس لجميع عناصر صفحات الويب، بينما CSS هو الأساس لشكل وتصميم الموقع، حيث بدونها سيكون الموقع نصًا مكتوبًا على صفحات بيضاء.",
  "title-card-m-slider-two-web-three": "إطار عمل Vue.js في تصميم الويب",
  "para-card-m-slider-two-web-three": "هو أحد أطر عمل JavaScript ويهدف إلى استخدامه لبناء تطبيقات الويب والواجهات الأمامية للمواقع. يتميز هذا الإطار بالسرعة العالية والأداء المتميز، وهو إطار عمل رسمي وصلب لتنفيذ المهام المختلفة.",
  "title-card-m-slider-two-web-four": "مكتبة JQuery في تصميم الويب",
  "para-card-m-slider-two-web-four": "هي مكتبة تحتوي على مجموعة من الوظائف السريعة والصغيرة، ومهمتها الرئيسية هي جعل استخدام JavaScript أسهل وأكثر مرونة، حيث تعمل على تقصير العمليات التي تحتاج إلى عدد كبير من أسطر الكود إلى مجموعة من الوظائف التي يتم استدعاؤها بسطر واحد فقط من الكود.",
  "title-card-m-slider-two-web-five": "إطار عمل Bootstrap",
  "para-card-m-slider-two-web-five": "يسهل إطار عمل Bootstrap عملية تصميم صفحات الويب، حيث يوفر فئات CSS جاهزة تُستخدم لعرض العناصر أو المكونات. وبالتالي، نضمن أن التصاميم التي تعتمد على Bootstrap في بنائها ستظهر بشكل جميل على الأجهزة المختلفة، سواء كانت هاتفًا محمولًا أو كمبيوترًا أو جهازًا لوحيًا.",
  "title-card-m-slider-two-web-six": "إطار عمل React Js",
  "para-card-m-slider-two-web-six": "يتخصص إطار عمل React Js في تطوير واجهات المواقع ويعمل بشكل رئيسي على إنشاء واجهات صفحة واحدة. يقوم React Js في الخلفية بتغيير العناصر المطلوبة دون إعادة تحميل الصفحة، مما يوفر بدوره أداءً سريعًا لصفحات الويب.",
  "title-card-m-slider-two-web-seven": "إطار عمل Angular",
  "para-card-m-slider-two-web-seven": "يُبنى إطار عمل Angular على لغة TypeScript ويعتمد على المكونات لبناء تطبيقات قابلة للتوسيع. يوفر لك هذا الإطار العديد من الميزات بما في ذلك التوجيه، والتواصل بين العميل والخادم، وإدارة القوالب، والمزيد."

}